[
  {
    "id": 0,
    "section": "Magnite Placement",
    "subtitle": "Software Engineer",
    "content": "1 Year Experience In The Magnite Belfast Office",
    "variant": "experience",
    "imgSrc": "magnite.jpg",
    "modalHeader": "Placement Year at Magnite",
    "modalSubtitle": "What I've Learnt",
    "modalContent": "I have developed a deep technical understanding of APIs, coding theory, and programming concepts, including OOP, component-based programming, and asynchronous programming. Proficient in both front-end and back-end coding, I excel at picking up new languages and adapting to diverse development environments. With experience creating, developing, and implementing login flows across multiple projects using various programming languages, I also have a solid understanding of SQL and database architecture. Additionally, I have worked professionally with Git for over a year, utilizing it for version control and collaborative development. \nMy skillset includes 6 months of hands-on experience with AWS and the SaaS platform Auth0, where I have been entrusted with admin roles and clearance. I am adept at working with MacOS, utilizing Bash Terminal for file manipulation, dependency installation, and managing JavaScript projects via NPM. These experiences have honed my ability to work effectively in professional environments, communicate within teams, and deliver high-quality, reliable solutions.",
    "href": "https://www.magnite.com/"

  },
  {
    "id": 1,
    "section": "This Website ",
    "subtitle": "React & Node.JS",
    "subtitleColor": "Aqua",
    "list": [
      "My First Full Website Built with the React Framework",
      "Uses React-Bootstrap ",
      "Data-Driven Website"
    ],
    "variant": "project",
    "imgSrc": "react.png",
    "modalHeader": "My Portfolio Website",
    "modalSubtitle": "This is my first website built with React",
    "modalContent": "I've learnt alot from this Project about Node.js, JS itself and most importantly how React fits into the web development stack, improving the scalability and consistency of websites! I've also used the react-bootstrap module for more fluid development."
  },
  {
    "id": 2,
    "section": "Govanopoly",
    "subtitle": "Java Game",
    "subtitleColor": "orange",
    "list": [
      "Sustainability-Themed Monopoly Game",
      "Team-Based Portfolio Work",
      "Sole Developer"
    ],
    "href": "https://github.com/VFConz/Monopoly_Style_Game_Java",
    "variant": "project",
    "imgSrc": "govanopoly.png",
    "modalHeader": "Govanopoly",
    "modalSubtitle": "Sustainability Focused Monopoly Game",
    "modalContent": "This team-based project took 4 weeks total development work from demo phase to release. I was the Lead Developer of the game and Team Lead for the project. The game focuses on tackling the serious sustainability issues tackling the Scottish City of Govan and took months of Research and Documentation before our development phase."
  },
  {
    "id": 3,
    "section": "Largest-Clock-Angle",
    "subtitle": "C++",
    "subtitleColor": "red",
    "list": [
      "Converts Time: 24hr to 12hr",
      "Finds Angle Difference",
      "Lightweight C++ Program",
      "Coding Challenge"
    ],
    "variant": "project",
    "href": "https://github.com/VFConz/Largest-Clock-Angle",
    "imgSrc": "clockproject.png",
    "modalHeader": "C++ Clock Conversion and Angle Difference Program",
    "modalSubtitle": "Developed in 2 Hours for a Company Challenge",
    "modalContent": "This Simple C++ Program converts a 24 hour formatted time into a 12 hour time and then calculates the largest angle between the minute and hour hand. Personally i thought this challenge was quite fun and engaging as I believe it was designed to test a candidates ability to breakdown physical objects into their respective properties and functions and manipulate these variables to produce the required output for the challenge. For testing i used try catch statements for any invalid data while it instantiates 100 instances of a 24 time, it's conversion and its largest angle. See for yourself in my Github Repository via the Link Below."
  },

  {
    "id": 4,
    "section": "Escape the Titanic",
    "subtitle": "HTML, CSS, JS",
    "subtitleColor": "gray",
    "list": [
      "Text-Based Escape Game",
      "Fully-featured",
      "Party & Inventory System",
      "JS Game Framework"
    ],
    "variant": "project",
    "href": "https://github.com/VFConz/TitanicEscapeGame",
    "imgSrc": "window.jpg",
    "modalHeader": "Titanic Escape Game",
    "modalSubtitle": "Part of my 1st Year Web Development Portfolio",
    "modalContent": "Team-Based Coursework where our goal was to develop a text-adventure game. The project was made in pure HTML, CSS and HTML and is a fully featured escape game. I am the developer of the Front-End and Additional Components such as Accessability Features, Animated Background, Game Over Screens, and the ScoreBoard and Points System for replayability. This Project netted us 80%"
  },

  {
    "id": 5,
    "section": "School Web-Dev Portfolio",
    "subtitle": "HTML, CSS, JS",
    "subtitleColor": "gray",
    "list": [
      "Basic HTML CSS Projects",
      "Fundamentals of HTML",
      "Beginner CSS Styling",
      "JS Functionality"
    ],
    "variant": "project",
    "href": "https://github.com/VFConz/WebDesignPortfolio-Year1",
    "imgSrc": "htmlcssjs.png",
    "modalHeader": "Web-Development Portfolio from First Year",
    "modalSubtitle": "My First Dive into Web-Development at Uni",
    "modalContent": "This collection of Projects are too small to be put on this website, but are good proofs of my grades throughout my Web-Development Module at Queens. It contains HTML, CSS and JS implementations adhering to constraints placed by the Module Coursework Requirements."
  },
  {
    "id": 6,
    "section": "Minesweeper CLI Game",
    "subtitle": "Kotlin Game",
    "subtitleColor": "orange",
    "list": [
      "MineSweeper Game in Kotlin",
      "Self-Learning Project",
      "Deep Knowledge of Map Function",
      "Favourite Project To Date"
    ],
    "href": "https://github.com/VFConz/WIP_MineSweeperGame_Kotlin",
    "variant": "project",
    "imgSrc": "Kotlin_Icon.png",
    "modalHeader": "Minesweeper CLI Game",
    "modalSubtitle": "1 Month Development Process",
    "modalContent": "From this Project I learn't Kotlin on a practical level, It is honestly one of my favourite languages to use as it is such an improvement to Java as it naturally imporves productivity due to the simplicity of manipulating data using maps and lists."
  },
  {
    "id": 7,
    "section": "Queen's University Belfast",
    "subtitle": "2021/2025",
    "content": "",
    "variant": "education",
    "list": ["Currently On Track for a First", "Grade Average 80%"],
    "href": "https://"
  },
  {
    "id": 8,
    "section": "St Patrick's Grammar School",
    "subtitle": "2013/2020",
    "content": "",
    "variant": "education",
    "list": ["GCSE Computer Science", "A-Level Digital Technology"],
    "href": ""
  }
]
